#define _CRT_SECURE_NO_WARNINGS
# include <stdio.h>

// 28470 _ 슥~빡! 빡~슥!

// 문제
// 복서 성우는 항상 공격과 회피를 연속적으로 한다.
// 슥~빡!빡~슥! 즉, 피하고 때리거나, 때리고 피한다.
// 
// 어느 날, 복서 성우는 숙명의 라이벌 성준이와 복싱 경기를 치르게 되었다.
// 이 경기에서 성우는 오직 N번의 공격 - 회피 연속 동작을 통해 성준을 상대할 예정이다.
// 
// 성우는 매 공격 - 회피 연속 동작 시의 체내 아드레날린 변화량을 정확히 알고 있다.
// i번째 공격 - 회피 연속 동작 상황에서, 공격 시에는 체내 아드레날린이 A_i만큼 증가하고, 회피 시에는 체내 아드레날린이 B_i만큼 감소한다.
// 또한 i번째 공격 - 회피 연속 동작 상황에서, 공격을 먼저 한다면, 공격 시 체내 아드레날린 증가량이 A_i 에서 a_i * k_i로 바뀌고,
// 회피를 먼저 한다면, 회피 시 체내 아드레날린 감소량이 B_i에서 b_i * k_i로 바뀐다.
// 성우는 경기 종료 시에 체내 아드레날린 양이 높을수록 만족스러운 경기를 치렀다고 생각한다.
// 
// 성우의 경기 종료 시 최대 체내 아드레날린 양을 구해보자.경기 시작 시 성우의 체내 아드레날린 양은 0이다.
// 
// 입력
// 첫째 줄에 연속 동작의 횟수 N이 주어진다. (1 <= N <= 100,000)
// 둘째 줄에 공격 시 체내 아드레날린 증가량을 나타내는 정수 A_i들이 공백으로 구분되어 주어진다. (10 <= A_i <= 1,000)
// 셋째 줄에 회피 시 체내 아드레날린 감소량을 나타내는 정수 B_i들이 공백으로 구분되어 주어진다. (10 <= B_i <= 1,000)
// 
// 넷째 줄에 아드레날린 증가량과 감소량의 변화를 나타내는 실수인 K_i들이 공백으로 구분되어 소수점 아래 첫째 자리까지 주어진다. (0 < K_i <= 1,000)
// 
// 출력
// 첫째 줄에 성우의 경기 종료 시 최대 체내 아드레날린 양을 출력한다.

int up[100011] = { 0, };
int down[100011] = { 0, };
int times[100011] = { 0.0, };

int main() {
    int N;
    scanf("%d", &N);
    double temp;
    for (int i = 0; i < N; i++) {
        scanf("%d", &up[i]);
    }
    for (int i = 0; i < N; i++) {
        scanf("%d", &down[i]);
    }
    for (int i = 0; i < N; i++) {
        scanf("%lf", &temp);
        temp = temp * 10;
        times[i] = (int)temp;
    }
    long long int sum = 0;
    for (int i = 0; i < N; i++) {
        if (times[i] >= 10) {
            sum = sum + ((times[i] * up[i]) / 10) - down[i];
        }
        else {
            sum = sum + up[i] - ((times[i] * down[i]) / 10);
        }
    }
    printf("%lld", sum);
}