#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

// 31090 _ 2023은 무엇이 특별할까?

// 문제
// 백준 온라인 저지의 송년대회 Good Bye, BOJ 2023!의 개최일은 2023년 12월 31일이다.
// 키파는 대회가 개최된다는 사실이 기뻐 2023과 2024를 뚫어져라 보다가 무언가 특별하다는 사실을 깨달았다.
// 
// 그렇다.내년의 연도인 2024가 올해 연도의 끝 두 자리인 23으로 나누어 떨어진다!
// 다음에도 이런 연도가 오려면 6년 뒤인 2029 / 2030년이 되어야 한다.
// 
// 양의 정수 N이 주어진다.
// N년과 N + 1년이 이러한 조건을 만족하는 관계인지 판별하는 프로그램을 작성하라.
// 
// 입력
// 첫째 줄에 테스트 케이스의 개수 T가 주어진다.
// 
// 이후 T개의 줄에 걸쳐 테스트 케이스가 한 줄에 하나씩 주어진다.
// 각 테스트 케이스는 한 줄로 구성되어 있으며, 각각 한 개의 양의 정수 N이 주어진다.
// 
// 출력
// 각 테스트 케이스에 대해, N + 1이 N의 끝 두 자리로 나누어 떨어진다면 Good을, 그렇지 않다면 Bye를 한 줄에 하나씩 차례로 출력하여라.

int main() {
	int N;
	scanf("%d", &N);
	int number;

	while (N--) {
		scanf("%d", &number);
		int temp = number % 100;
		number++;
		if (number % temp == 0) {
			printf("Good\n");
		}
		else {
			printf("Bye\n");
		}
	}
}